import java.util.Scanner;

public class Eight {
    /**
     * Задание 8.11
     * Напишите класс, который принимает с клавиатуры два числа: первое -
     * количество учеников в классе, второе - количество стульев в классной
     * комнате.
     * Программа проверит соответствие между этими двумя значениями и
     * выведет на экран соответствующую информацию (например, для значений
     * 35 и 39 на экран выводится 4 стула лишних).
     */

    public static void EightOneOne() {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Enter the number of students");
        int countStudents = scanner.nextInt();
        System.out.println("Enter the number of chairs");
        int countChairs = scanner.nextInt();
        scanner.close();
        if ((countStudents - countChairs) != 0) {
            System.out.println((countStudents < countChairs) ? "Extra chairs = " + (countChairs - countStudents) :
                    "A shortage of chairs = " + (countStudents - countChairs));
        }
        if ((countStudents - countChairs) == 0) {
            System.out.println("All students had enough chairs and no extra ones left");
        }

    }

    /**
     * Задание 8.12
     * Напишите класс, который принимает с клавиатуры оценку ученика
     * (целое число) и проверяет, не является ли введенное значение ошибочным.
     * На экран должно выводиться соответствующее текстовое сообщение.
     */
    public static void EightOneTwo() {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Enter student grade");
        int studentGrade = scanner.nextInt();
        scanner.close();
        System.out.println((studentGrade > 0) & (studentGrade <= 5) ? "The grade is correct" : "The grade is incorrect");

    }


    /**
     * Задание 8.13
     * Напишите класс, который принимает с клавиатуры двузначное положительное
     * число и проверяет, составлено ли оно из одинаковых цифр.
     * В соответствии с результатом проверки надо вывести на экран соответствующее
     * текстовое сообщение.
     */
    public static void EightOneThree() {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Please enter a two-digit positive number");
        int positiveTwoDigitNumber = scanner.nextInt();
        scanner.close();
        System.out.println((positiveTwoDigitNumber / 10) == (positiveTwoDigitNumber % 10) ? "The number consists of the same digits"
                : "The number consists of different digits");
    }

    /**
     * Задание 8.14
     * Напишите класс, который принимает с клавиатуры двузначное положительное
     * число и проверяет, является ли в нем первая цифра (десятков)
     * больше второй (единиц). В соответствии с результатом проверки
     * надо вывести на экран соответствующее текстовое сообщение.
     */
    public static void EightOneFour() {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Please enter a two-digit positive number");
        int positiveTwoDigitNumber = scanner.nextInt();
        scanner.close();
        System.out.println((positiveTwoDigitNumber / 10) > (positiveTwoDigitNumber % 10)
                ? "The digit denoting tens is greater than the digit denoting units"
                : "A digit denoting tens, no more than a digit denoting units");
    }

    /**
     * Задание 8.15
     * Напишите класс, который принимает с клавиатуры двузначное положительное
     * число и проверяет, какая из его двух цифр является большей.
     * В соответствии с результатом проверки надо вывести на экран
     * соответствующее текстовое сообщение. Не следует выводить на экран
     * никакого сообщения, если число составлено из одинаковых цифр.
     */
    public static void EightOneFive() {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Please enter a two-digit positive number");
        int positiveTwoDigitNumber = scanner.nextInt();
        scanner.close();
        System.out.println((positiveTwoDigitNumber / 10) > (positiveTwoDigitNumber % 10)
                ? "The digit denoting tens is greater than the digit denoting units"
                : "A digit denoting tens, no more than a digit denoting units");
    }

    /**
     * Задание 8.16
     * Трехзначное число называется «симметричным», если первая и последняя
     * его цифры одинаковы.
     * Напишите класс, который принимает с клавиатуры трехзначное положительное
     * число и проверяет, является ли оно «симметричным». В соответствии
     * с результатом проверки надо вывести на экран соответствующее
     * текстовое сообщение.
     */
    public static void EightOneSix() {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Please enter a three-digit positive number");
        int positiveThreeDigitNumber = scanner.nextInt();
        scanner.close();
        System.out.println((positiveThreeDigitNumber / 100) == (positiveThreeDigitNumber % 10) ? "symmetric number"
                : "the number is not symmetrical");
    }

    /**
     * Задание 8.17
     * Трехзначное число называется «дважды четным», если и оно само, и
     * сумма его цифр - четные.
     * Напишите класс, который принимает с клавиатуры трехзначное положительное
     * число и проверяет, является ли оно «дважды четным».
     * В соответствии с результатом проверки надо вывести на экран соответствующее
     * текстовое сообщение.
     * Обратите внимание: задание имеет решение с использованием единственного
     * оператора if- без составного условия!
     */
    public static void EightOneSeven() {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Please enter a three-digit positive number");
        int number = scanner.nextInt();
        Boolean evenNumber = (number == ((number / 2) * 2));
        int sum = ((number / 100) + (number % 10) + ((number % 100) / 10));
        Boolean sumDigit = ((sum / 2) == ((sum / 2) * 2));
        System.out.println(evenNumber & sumDigit ? "Double even number" : "");
    }

    /**
     * Задание 8.18
     * Назовем «степенью четности» числа количество четных цифр в его составе
     * (например, степень четности для 2346 равна 3).
     * Напишите класс, который принимает с клавиатуры трехзначное положительное
     * число и определяет, какова его «степень четностю>. В соответствии
     * с результатом проверки надо вывести на экран соответствующее
     * текстовое сообщение.
     */

    /**
     * Задание 8.19
     * Четырехзначное число называется «парно-симметричным», если две
     * его первых цифры и две его последних цифры образуют одинаковые
     * числа (например - 5252).
     * Напишите класс, который принимает с клавиатуры четырехзначное
     * положительное число и определяет, является ли оно «парно-симметричным
     * ». В соответствии с результатом проверки надо вывести на
     * экран соответствующее текстовое сообщение.
     */

    /**
     * Задание 8.20
     * Напишите класс, который принимает с клавиатуры трехзначное положительное
     * число и проверяет, содержится ли в нем хотя бы один ноль.
     * По результатам проверки надо вывести на экран соответствующее текстовое
     * сообщение.
     */

    /**
     * Задание 8.21
     * Напишите класс, который принимает с клавиатуры положительное
     * целое число и выводит на экран ближайшее к нему «крутлое число».
     * Например, для введенного значения 433 выводится на экран 430, а для
     * 56 выводится 60.
     */

    /**
     * Задание 8.22
     * Напишите класс, который принимает с клавиатуры целое положительное
     * число и изменяет его следующим образом:
     * • для четного числа - увеличивает его до ближайшего «крутлого» и
     * выводит новое значение на экран вместе с сообщением Up to."
     * • для нечетного числа - уменьшает его до ближайшего «крутлого» и
     * выводит новое значение на экран вместе с сообщением Down to".
     * Например, для введенного значения 433 на экран выводится Down to
     * 430, а для 56 выводится Up to 60.
     */

    /**
     * Задание 8.23
     * Напишите класс, который принимает с клавиатуры два целых числа и
     * изменяет их следующим образом:
     * • при разных значениях, большее число уменьшается на 1, а меньшее
     * - увеличивается на 1;
     * • при одинаковых значениях чисел оба увеличиваются на 1.
     * Программа должна вывести на экран новые значения переменных.
     */

    /**
     * Задание 8.24
     * Напишите класс, который принимает с клавиатуры целое трехзначное
     * положительное число и изменяет его следующим образом:
     * • для чисел, больших 500, - переставляет местами числа единиц и
     * сотен (вместо 672 - 276);
     * • в остальных числах переставляются местами числа десятков и
     * единиц (вместо 363 - 336).
     * Программа должна вывести на экран новое значение переменной.
     */

    /**
     * Задание 8.25
     * Напишите класс, который принимает с клавиатуры целое положительное
     * число, и затем:
     * • в случае если введено четное число, - принимает с клавиатуры
     * дробное число и выводит на экран произведение этих двух чисел;
     * • в противном случае - принимает с клавиатуры целое число и выводит
     * на экран сумму этих двух чисел.
     */

    /**
     * Задание 8.26
     * Симметричным («палиндромом») называется число, которое дает одинаковое
     * значение при чтении его справа налево и слева направо (например,
     * 787).
     * Напишите класс, который принимает с клавиатуры положительное число
     * (не большее 99999) и проверяет, является ли это число палиндромом.
     * Класс должен выводить на экран соответствующее текстовое сообщение.
     */

    /**
     * Задание 8.27
     * Напишите класс, который принимает в качестве параметров два целых
     * положительных числа и выводит на экран с дополнительным сообщением
     * то из них, у которого наибольшая последняя цифра (число единиц).
     * Если такого числа нет, класс должен вывести на экран соответствующее
     * сообщение.
     */

    /**
     * Задание 8.28
     * Напишите класс, который принимает с клавиатуры два целых положительных
     * числа. Класс должен определить, могут ли эти числа быть числителем
     * (первое) и знаменателем (второе) дроби.
     * В случае если могут, класс должен определить, является ли эта дробь
     * правильной, неправильной или же она выражает целое число, а также
     * вывести на экран соответствующее текстовое сообщение.
     * В случае если числа не могут выражать дробь, следует вывести на экран
     * соответствующее объяснение.
     */

    /**
     * Задание 8.29
     * Напишите класс, который принимает с клавиатуры две пары целых
     * ненулевых чисел: первая пара является числителем и знаменателем одной
     * дроби, вторая пара - числителем и знаменателем другой дроби.
     * Класс должен проверить, равны ли эти дроби друг другу, и вывести на
     * экран соответствующее текстовое сообщение.
     */

    /**
     * Задание 8.30
     * Напишите класс, который принимает с клавиатуры два целых числа.
     * Класс должен определить, мoryr ли эти числа быть числителем (первое)
     * и знаменателем (второе) дроби.
     * В случае если числа выражают неправильную дробь, следует вывести
     * на экран соответствующую ей правильную сложную дробь, а во всех
     * остальных случаях - текстовое сообщение Подсчет не производится.
     * Например, если с клавиатуры введены значения 7 и 12 - на экран выводится
     * сообщение Подсчет не производится; если введены 12 и 7, то
     * на экран выводится 1 5/7.
     */

    /**
     * Задание 8.31
     * Напишите класс, который принимает с клавиатуры трехзначное число
     * и изменяет его следующим образом:
     * • для четных чисел - все четные цифры увеличиваются на 1, а нечетные
     * уменьшаются на 1; в случае если это невозможно, они остаются
     * неизменными;
     * • в нечетных числах все изменения производятся «наоборот».
     * Программа должна вывести на экран новое значение переменной.
     */

    /**
     * Задание 8.32
     * Напишите класс, который принимает с клавиатуры целое число, и затем:
     * • в случае если введено четное число, - принимает с клавиатуры
     * дробное число и выводит на экран произведение этих двух чисел;
     * в противном случае - принимает с клавиатуры целое число и вы-
     * водит на экран сумму этих двух чисел.
     */
}
